# Taller 00 - Analítica de Datos
- **Autor:** David Santiago Barreto Mora.
- **Fecha de entrega:** 10/08/2023 
- **Profesor:** Ing. John Corredo, PhD.
---

## Fuente de datos
Para el desarrollo del taller, se usan los archivos de extension .csv dados por el profesor. Los archivos detallan las ventas hechas en Colombia en 2019, de lo que se presume es una tienda de tecnología. En total son 12 archivos, cada uno correspondiendo a las ventas de un mes, por lo que el dataset en total constituye las ventas anuales del 2019 de la empresa en cuestión.

Para poder comenzar realizar el trabajo analítico, primero importamos las librerias a ser usadas, y por supuesto, los archivos .csv.

### Carga de librerias

In [2]:
# Se importan las librerias que serán usadas en el análisis.
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt

### Carga de los datos (archivos .csv) 
A continuación se cargan los 12 archivos CSV y se crea un dataframe por cada uno. Esto con la intención de unir todos los dataframes en uno solo, para posteriormente facilitar su manipulación y análisis.

In [7]:
# Se importan los 12 archivos .csv, y por cada uno se crea un dataframe (libreria pandas)
dfJanuary = pd.read_csv("Ventas/Ventas_January_2019.csv")
dfFebruary = pd.read_csv("Ventas/Ventas_February_2019.csv")
dfMarch = pd.read_csv("Ventas/Ventas_March_2019.csv")
dfApril = pd.read_csv("Ventas/Ventas_April_2019.csv")
dfMay = pd.read_csv("Ventas/Ventas_May_2019.csv")
dfJune = pd.read_csv("Ventas/Ventas_June_2019.csv")
dfJuly = pd.read_csv("Ventas/Ventas_July_2019.csv")
dfAugust = pd.read_csv("Ventas/Ventas_August_2019.csv")
dfSeptember = pd.read_csv("Ventas/Ventas_September_2019.csv")
dfOctober = pd.read_csv("Ventas/Ventas_October_2019.csv")
dfNovember = pd.read_csv("Ventas/Ventas_November_2019.csv")
dfDecember = pd.read_csv("Ventas/Ventas_December_2019.csv")

A continuación imprimimos las primera fila de cada dataframe. Principalmente, para ver que las columnas de todos los dataframes sean las mismas. Esta verificicación es hecha para validar que se puedan unir los dataframes en uno solo.

In [8]:
# Se muestra la primera columna del dataframe de enero.
dfJanuary.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,141234,Audifonos Apple Airpods,1,499900,01/25/19 13:51,"177 calle Jimenez, Cali, VC"

In [9]:
# Se muestra la primera columna del dataframe de febrero.
dfFebruary.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,153258,Multiolla Oster 0150 Negra PE,1,299900,02/04/19 07:28,"724 calle Adams, Cúcuta, NS"

In [10]:
# Se muestra la primera columna del dataframe de marzo.
dfMarch.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,163171,LG Secadora Carga Frontal,1,1646900,03/31/19 11:58,"591 calle Adams, Medellin, AN"

In [11]:
# Se muestra la primera columna del dataframe de abril
dfApril.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,171346,Cable de Carga USB-C P/O,1,46900,04/04/19 19:25,"631 calle Boyacá, Armenia, QU"

In [12]:
# Se muestra la primera columna del dataframe de mayo.
dfMay.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,182565,LG Lavadora 19Kg Inv WT19,1,1646900,05/05/19 10:02,"722 calle Adams, Bogotá, CU"

In [13]:
# Se muestra la primera columna del dataframe de junio.
dfJune.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,195098,Cable de Carga Lightning,1,64900,06/17/19 20:12,"736 calle Transversal, Medellin, AN"

In [14]:
# Se muestra la primera columna del dataframe de julio.
dfJuly.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,211128,AAA Batteries (4-pack),1,12990,07/09/19 21:48,"327 calle Carrera, Cúcuta, NS"

In [15]:
# Se muestra la primera columna del dataframe de agosto.
dfAugust.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,224782,AAA Batteries (4-pack),2,12990,08/04/19 08:24,"91 calle Boyacá, Armenia, QU"

In [16]:
# Se muestra la primera columna del dataframe de septiembre.
dfSeptember.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,242703,Samsung Galaxy A302,1,649900,09/19/19 12:57,"508 calle 11ra, Manizalez, CA"

In [17]:
# Se muestra la primera columna del dataframe de octubre.
dfOctober.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,246400,Freidora Saludable B&D 3.5 Litros,1,229900,10/05/19 17:01,"893 calle 14va, Manizalez, CA"

In [18]:
# Se muestra la primera columna del dataframe de noviembre.
dfNovember.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,260944,Freidora Saludable B&D 3.5 Litros,1,229900,11/12/19 14:57,"79 calle Avenida, Armenia, QU"

In [19]:
# Se muestra la primera columna del dataframe de diciembre.
dfDecember.head(1)

,ID Orden,Producto,Cantidad Ordenada,Precio Unitario,Fecha,Dirección de Compra
0,276339,Audifonos Bose SoundSport,1,399900,12/11/19 19:29,"345 calle Pte Aranda, Neiva, HU"

Como se puede ver, todos los dataframes (o archivos .csv) cuentan con 6 columnas:
1. ID Orden
2. Producto
3. Cantidad Ordenada
4. Precio Unitario
5. Fecha
6. Dirección de Compra

Por lo que podemos seguir con la combinación de todos los dataframes en uno solo.

In [25]:
print(dfJanuary.shape)
print(dfFebruary.shape)
print(12554 + 10355)
mergedDf = pd.merge(dfJanuary, dfFebruary, how="outer")
print(mergedDf.shape)

(12554, 6)
(10355, 6)
22909
(24474, 6)